cucumber-jmeter-framework/jmeter.log
2026-04-22 11:12:56,525 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-04-22 11:12:56,566 INFO o.a.j.JMeter: Loading user properties from: C:\Users\harsh\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\user.properties
2026-04-22 11:12:56,569 INFO o.a.j.JMeter: Loading system properties from: C:\Users\harsh\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\system.properties
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: Version 5.6.3
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: java.version=21.0.9
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: os.name=Windows 11
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: os.arch=amd64
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: os.version=10.0
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: java.awt.headless=true
2026-04-22 11:12:56,582 INFO o.a.j.JMeter: Max memory     =1073741824
2026-04-22 11:12:56,583 INFO o.a.j.JMeter: Available Processors =12
2026-04-22 11:12:56,603 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-04-22 11:12:56,604 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-04-22 11:12:56,604 INFO o.a.j.JMeter: JMeterHome=C:\Users\harsh\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2026-04-22 11:12:56,604 INFO o.a.j.JMeter: user.dir  =C:\Users\harsh\Downloads\cucumber-jmeter-framework\cucumber-jmeter-framework
2026-04-22 11:12:56,605 INFO o.a.j.JMeter: PWD       =C:\Users\harsh\Downloads\cucumber-jmeter-framework\cucumber-jmeter-framework
2026-04-22 11:12:56,610 INFO o.a.j.JMeter: IP: 172.21.0.94 Name: Harsh FullName: 172.21.0.94
2026-04-22 11:12:56,649 INFO o.a.j.s.FileServer: Default base='C:\Users\harsh\Downloads\cucumber-jmeter-framework\cucumber-jmeter-framework'
2026-04-22 11:12:56,652 INFO o.a.j.s.FileServer: Set new base='C:\Users\harsh\Downloads\cucumber-jmeter-framework\cucumber-jmeter-framework'
2026-04-22 11:12:57,043 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-04-22 11:12:57,119 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-04-22 11:12:57,128 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-04-22 11:12:57,135 INFO o.a.j.s.SaveService: Loading file: C:\Users\harsh\Downloads\cucumber-jmeter-framework\cucumber-jmeter-framework\testplan.jmx
2026-04-22 11:12:57,261 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 11:12:57,261 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 11:12:57,261 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 11:12:57,261 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-22 11:12:57,262 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-04-22 11:12:57,262 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-04-22 11:12:57,341 INFO o.a.j.JMeter: Creating summariser <summary>
2026-04-22 11:12:57,380 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-04-22 11:12:57,382 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-22 11:12:57,382 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-22 11:12:57,393 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-04-22 11:12:57,393 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-04-22 11:12:57,543 INFO o.a.j.JMeter: Running test (1776836577541)
2026-04-22 11:12:57,580 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users Thread Group
2026-04-22 11:12:57,580 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Users Thread Group.
2026-04-22 11:12:57,580 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-04-22 11:12:57,581 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-04-22 11:12:57,595 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-1
2026-04-22 11:12:57,597 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-04-22 11:12:57,598 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-04-22 11:12:57,634 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Harsh
2026-04-22 11:12:57,644 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-04-22 11:12:57,647 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-04-22 11:12:57,647 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-04-22 11:12:57,647 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-04-22 11:12:57,648 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-04-22 11:12:57,887 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-1
2026-04-22 11:12:57,887 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-1
2026-04-22 11:12:58,087 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-2
2026-04-22 11:12:58,091 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-2
2026-04-22 11:12:58,091 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-2
2026-04-22 11:12:58,587 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-3
2026-04-22 11:12:58,591 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-3
2026-04-22 11:12:58,591 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-3
2026-04-22 11:12:59,086 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-4
2026-04-22 11:12:59,092 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-4
2026-04-22 11:12:59,092 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-4
2026-04-22 11:12:59,584 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-5
2026-04-22 11:12:59,588 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-5
2026-04-22 11:12:59,588 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-5
2026-04-22 11:13:00,086 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-6
2026-04-22 11:13:00,093 INFO o.a.j.r.Summariser: summary +      6 in 00:00:03 =    2.4/s Avg:    11 Min:     0 Max:    66 Err:     6 (100.00%) Active: 1 Started: 6 Finished: 5
2026-04-22 11:13:00,094 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-6
2026-04-22 11:13:00,094 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-6
2026-04-22 11:13:00,582 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-7
2026-04-22 11:13:00,586 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-7
2026-04-22 11:13:00,586 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-7
2026-04-22 11:13:01,083 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-8
2026-04-22 11:13:01,086 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-8
2026-04-22 11:13:01,086 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-8
2026-04-22 11:13:01,582 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-9
2026-04-22 11:13:01,586 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-9
2026-04-22 11:13:01,587 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-9
2026-04-22 11:13:02,084 INFO o.a.j.t.JMeterThread: Thread started: Users Thread Group 1-10
2026-04-22 11:13:02,089 INFO o.a.j.t.JMeterThread: Thread is done: Users Thread Group 1-10
2026-04-22 11:13:02,089 INFO o.a.j.t.JMeterThread: Thread finished: Users Thread Group 1-10
2026-04-22 11:13:02,093 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-04-22 11:13:02,095 INFO o.a.j.r.Summariser: summary +      4 in 00:00:02 =    2.0/s Avg:     1 Min:     1 Max:     1 Err:     4 (100.00%) Active: 0 Started: 10 Finished: 10
2026-04-22 11:13:02,096 INFO o.a.j.r.Summariser: summary =     10 in 00:00:05 =    2.2/s Avg:     7 Min:     0 Max:    66 Err:    10 (100.00%)